app/Controllers/PecesController.php

    public function index()
    {
        $pecesModel = new PecesModel();
        $data['peces'] = $pecesModel->where('FECHA_BAJA', NULL)->findAll(); // Solo peces activos
---
SELECT *
FROM `PECES`
WHERE `FECHA_BAJA` IS NULL

        // --------paginación-------------
        $perPage = 4; // Número de elementos por página
        $page = $this->request->getVar('page') ?: 1;  // Obtener la página actual
        $data['peces'] = $pecesModel->paginate($perPage, 'default', $page);
---
SELECT *
FROM `PECES`
 LIMIT 12, 4
SELECT COUNT(*) AS `numrows`
FROM `PECES`


                if ($id) {
                    // Actualizar pez existente
                    $pecesModel->update($id, $pecesData);
---
UPDATE `PECES` SET `ESPECIE` = 'orcio la somenetona', `FECHA_NACIMIENTO` = '2025-02-08', `PESO` = '-43', `LONGITUD` = '11', `TIPO_AGUA` = 'salada'
WHERE `PECES`.`ID_PEZ` IN ('23')