app/Controllers/PedidosController.php

SELECT COUNT(*) AS `numrows`
FROM `PEDIDOS`
LEFT JOIN `USUARIOS` ON `PEDIDOS`.`ID_USUARIO` = `USUARIOS`.`ID_USUARIO`
LEFT JOIN `PECES` ON `PEDIDOS`.`ID_PEZ` = `PECES`.`ID_PEZ`
---
    }

    // Realizar la unión para obtener NOMBRE_USUARIO y ESPECIE
    $pedidos = $pedidoModel->select('PEDIDOS.*, USUARIOS.NOMBRE_USUARIO, PECES.ESPECIE')
        ->join('USUARIOS', 'PEDIDOS.ID_USUARIO = USUARIOS.ID_USUARIO', 'left') // Unión con la tabla USUARIOS
        ->join('PECES', 'PEDIDOS.ID_PEZ = PECES.ID_PEZ', 'left') // Unión con la tabla PECES para obtener la ESPECIE
        ->orderBy($sort, $order)
        ->paginate(4);