app/Controllers/ProveedoresController.php

SELECT *
FROM `PROVEEDORES`
WHERE `FECHA_BAJA` IS NULL
---
    public function index()
    {
        $proveedoresModel = new ProveedoresModel();
        $data['proveedores'] = $proveedoresModel->where('FECHA_BAJA', NULL)->findAll(); // Solo proveedores activos

SELECT *
FROM `PROVEEDORES`
 LIMIT 16, 4
SELECT COUNT(*) AS `numrows`
FROM `PROVEEDORES`
---
        // Paginación
        $perPage = 4; // Número de elementos por página
        $page = $this->request->getVar('page') ?: 1;  // Obtener la página actual
        $data['proveedores'] = $proveedoresModel->paginate($perPage);