app/Controllers/TanquesController.php

SELECT *
FROM `TANQUES`
WHERE `FECHA_BAJA` IS NULL
---
    public function index()
    {
        $tanquesModel = new TanquesModel();
        $data['tanques'] = $tanquesModel->where('FECHA_BAJA', NULL)->findAll(); // Solo tanques activos

SELECT *
FROM `TANQUES`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `TANQUES`
---
        // --------paginación-------------
        $perPage = 4;
        $page = $this->request->getVar('page') ?: 1;  // Obtener la página actual
        $data['tanques'] = $tanquesModel->paginate($perPage);