app/Controllers/UsuarioController.php

    public function index()
    {
        $usuarioModel = new UsuarioModel();
        $data['usuarios'] = $usuarioModel->where('FECHA_BAJA', NULL)->findAll(); // Solo usuarios activos
---
SELECT *
FROM `USUARIOS`
WHERE `FECHA_BAJA` IS NULL

        // --------pginacion-------------
        $perPage =4; //numero de elementos por pagina
        $page = $this->request->getVar('page') ?: 1;  // Obtener la página actual
        $data['usuarios'] = $usuarioModel->paginate($perPage);
---
SELECT *
FROM `USUARIOS`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `USUARIOS`